/* CLLocationManager error kCLErrorRangingFailure */
"A general ranging error occurred." = "Se ha producido un error general de corta ubicación.";

/* CLLocationManager error kCLErrorRegionMonitoringFailure */
"A registered region cannot be monitored." = "Una región registrada no puede ser monitoreada.";

/* CLLocationManager error kCLErrorDenied */
"Access to the location service was denied by the user." = "Acceso al servicio de localización fue negado por el usuario.";

/* CLLocationManager error kCLErrorRegionMonitoringDenied */
"Access to the region monitoring service was denied by the user." = "Acceso al servicio de monitoreo de la región fue negado por el usuario.";

/* CLLocationManager error kCLErrorRegionMonitoringSetupDelayed */
"Core Location could not initialize the region monitoring feature immediately." = "Core Location no pudo inicializar la monitorización de región inmediatamente.";

/* CLLocationManager error kCLErrorRegionMonitoringResponseDelayed */
"Core Location will deliver events but they may be delayed." = "Core Location will deliver events but they may be delayed.";

/* CLLocationManager error kCLErrorDeferredDistanceFiltered */
"Deferred mode does not support distance filters." = "Modo diferido no admite filtros de distancia.";

/* CLLocationManager error kCLErrorDeferredAccuracyTooLow */
"Deferred mode is not supported for the requested accuracy." = "Modo diferido no es compatible con la precisión requerida.";

/* CLLocationManager error kCLErrorRangingUnavailable */
"Ranging is disabled. This might happen if the device is in Airplane mode or if Bluetooth or location services are disabled." = "Corta ubicación está desactivada. Esto puede suceder si el dispositivo está en modo avión o si los servicios de Bluetooth o localización están desactivados.";

/* CLLocationManager error kCLErrorGeocodeCanceled */
"The geocode request was canceled." = "La solicitud de geocodificación fue cancelada.";

/* CLLocationManager error kCLErrorGeocodeFoundPartialResult */
"The geocode request yielded a partial result." = "La solicitud de geocodificación arrojó un resultado parcial.";

/* CLLocationManager error kCLErrorGeocodeFoundNoResult */
"The geocode request yielded no result." = "La solicitud de geocodificación no arrojado ningún resultado.";

/* CLLocationManager error kCLErrorHeadingFailure */
"The heading could not be determined." = "El rumbo no pudo ser determinado.";

/* CLLocationManager error kCLErrorDeferredNotUpdatingLocation */
"The location manager did not enter deferred mode because location updates were already disabled or paused." = "El gerente de localización no entre en el modo diferido porque cambios de ubicación ya están desactivados o en pausa.";

/* CLLocationManager error kCLErrorDeferredFailed */
"The location manager did not enter deferred mode for an unknown reason." = "El gerente de localización no entre en el modo diferido por una razón desconocida.";

/* CLLocationManager error kCLErrorLocationUnknown */
"The location manager was unable to obtain a location value right now." = "El gerente de localización no pudo obtener un valor de ubicación en estos momentos.";

/* CLLocationManager error kCLErrorNetwork */
"The network was unavailable or a network error occurred." = "La red no estaba disponible o se produjo un error de red.";

/* CLLocationManager error kCLErrorDeferredCanceled */
"The request for deferred updates was canceled by a subsequent call." = "La solicitud de actualizaciones diferidas fue cancelada por una llamada posterior.";

